In [4]:
!pip install pandas

Requirement already satisfied: pandas in s:\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in s:\anaconda3\lib\site-packages (from pandas) (1.16.2)
Requirement already satisfied: pytz>=2011k in s:\anaconda3\lib\site-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.5.0 in s:\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\marke\appdata\roaming\python\python37\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [5]:
import pandas

initial_dataframeSource = pandas.read_excel("ChildReward.xlsx")
# m = input("=> ")
# print(m)
initial_dataframeSource.head()

,Unnamed: 0,Toilet,Laundry,Livingroom,kitchen,kids room,shoes,vaccum,clothes
0,Connor,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Charlotte,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Caden,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
child_reward_dataframe = initial_dataframeSource.copy()
# child_reward_dataframe.apply(pandas.to_numeric, errors= 'coerce').fillna(0)
child_reward_dataframe.head()

,Unnamed: 0,Toilet,Laundry,Livingroom,kitchen,kids room,shoes,vaccum,clothes
0,Connor,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Charlotte,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Caden,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
child_reward_dataframe.columns

Index(['Unnamed: 0', 'Toilet', 'Laundry', 'Livingroom', 'kitchen', 'kids room',
       'shoes', 'vaccum', 'clothes'],
      dtype='object')

In [8]:
for item in child_reward_dataframe:
    
    child_reward_dataframe[item].apply(pandas.to_numeric, errors= 'coerce').fillna(0)
    
child_reward_dataframe.head()

,Unnamed: 0,Toilet,Laundry,Livingroom,kitchen,kids room,shoes,vaccum,clothes
0,Connor,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Charlotte,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Caden,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

NameError: name 'Toilet' is not defined